{
    "greetings": "Hi, my name is LuLa, I am a Lunar Lander. What can I do for you?",
    "greetings2": "Hey, nice to meet you! What can I do for you today? Do you want some information about me?",
    "goodbye": "I'm sorry to hear that, but there's no problem, I hope to see you soon, goodbye!",
    "info": "I am a Lunar Lander. My job is to land safely on the Moon. I can do it by being manually commanded by you through a game or by my planning capabilities and simulator, i come with some premade discretizations that can lead to different performances, some good, some bad.",
    "reset": "Okay, I'm closing the current modality. Tell me if you want to do it again from the start or if you want to quit.",
    "repeat": "I am sorry I didn't actually understood what you said, please repeat it, and if possible reformulate your question, thank you.",
    "ready": "Okay, my environment is set up, tell me when you are ready and the task will start.",
    "confirm": "Are you sure that you want to stop the current task?",
    "start_game": "Alright, I am going to start. The available commands are Go Up, Idle, Go Left and Go Right and you can quit whenever you want. The standard goal is to land on ground between the flags, but feel free to fly wherever you want. Have Fun!",
    "continue": "I understand, let's continue the task.",
    "move": "What is your next move?",
    "lose": "I am sorry to tell you that we failed, tell me if you want to try again or to stop.",
    "win": "Congratulations, you have done it! Nasa should hire you as an astronaut, or at least as an engineer. Do you want to try again or close the task?",
    "start_simulator": "In order to run me, please select a domain and then a goal.",
    "end_simulator": "Simulation finished, what do you want to do now?",
    "models": "The available Lunar Lander models are: 'No Velocity', the simpliest abstraction in which the velocity is not modeled, 'Simplified', here velocities are modeled but considered as effect only in actions that actually modify them, and 'Mini', the most realistic model but with very large discrete bins.",
    "goals": "My engineers programmed me to land safely in between two flags, maybe I can try something else, but I can't guarantee any success.",
    "goals_info": "The default goal is the landing one and I already have a plan to apply, otherwise you can define a new goal state and I will try to find a plan for it.",
    "plan_ready": "Okay, I have a plan for it. Do you want to know some details?",
    "questions": "You can ask whatever you want about the plan, the maximum velocities expected or the averages, or maybe how many corrections of the trajectory I planned to do, or details of rewards expected or simply the number of steps too.",
    "define_prob": "Now I need to know the starting and goal state, and in order to be very clear with that we will procede step by step, do you want a default state or a custom one?",
    "ask_goal_x": "Now what is the final x coordinate that you would like to reach?",
    "ask_goal_y": "And what should be the final y coordinate?",
    "ask_init_x": "What is your desired initial x coordinate? Left, Right or at the Center?",
    "ask_init_y": "What is your desired initial y coordinate? Low, High or at the Middle?",
    "wait": "I am planning the new goal and it may take from zero to some minutes, in the meantime would you like to play with the lander or to hear the story of the first landing on the moon?",
    "end": "The story has finished, I hope you found it interesting, unfortunately I have not finished planning, do you want to play now or hear the story one more time?",
    "planned": "Oh, I have just finished planning for your new goal and tried to apply it, do you want to know some details?"
}